
#Область ПрограммныйИнтерфейс

// Процедура - Код инициализации по типам
//
// Параметры:
//  КодИнициализации - Соответствие - тип данных и код для его установки
//
// Пример кода:
//  КодИнициализации.Вставить(Тип("СправочникСсылка.ПодразделенияОрганизаций"), "озТестовыеДанные.ПоздразделениеОрганизации(""%1"", Организация); // %1");
//
Процедура КодИнициализацииПоТипам(КодИнициализации) Экспорт
	
КонецПроцедуры

// Функция - Порядок сортировки переменных
// 
// Возвращаемое значение:
// Соответствие - типы значений и их порядок для сортировки 
// 
// Пример:
//		Порядок.Вставить(Тип("СправочникСсылка.Организации"), 0);
//		Порядок.Вставить(Тип("СправочникСсылка.ПодразделенияОрганизаций"), 1);
//		Порядок.Вставить(Тип("СправочникСсылка.Валюты"), 2);
//		Порядок.Вставить(Тип("СправочникСсылка.Контрагенты"), 3);
//		Порядок.Вставить(Тип("СправочникСсылка.ДоговорыКонтрагентов"), 4);
//
Функция ПорядокСортировкиПеременных() Экспорт
	
	Порядок = Новый Соответствие;

	Возврат Порядок;
		
КонецФункции

// Функция - Постоянные данные
// 
// Возвращаемое значение:
// Соответствие - Данные которые являются постоянными для системы, и их можно искать по идентификатору указаном в значении
//
// Пример:
//		ПостоянныеДанные.Вставить(Тип("СправочникСсылка.Валюты"), "Код");
//		ПостоянныеДанные.Вставить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"), "Наименование");
//
Функция ПостоянныеДанные() Экспорт
	
	ПостоянныеДанные = Новый Соответствие;
	
	Возврат ПостоянныеДанные;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти